Documents/Расход.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Document>
		<Properties>
			<Name>Расход</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Кошельки</xr:Item>
				<xr:Item>AccumulationRegister.Затраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Кошельки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>Кошельки</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/Затраты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<AccumulationRegister>
		<Properties>
			<Name>Затраты</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Кошелек</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кошельки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Статья</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Статьи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Расход/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	      //Если цель затраты - кошелек, то это перевод и мы делаем два проведения ТОЛЬКО по регистру кошельков и ни одного по затратам
		  Если ТипЗнч(Цель) = Тип("СправочникСсылка.Кошельки") Тогда
			        //1. Списываем с кошелька-источника
		            Движения.Кошельки.Записывать = Истина;
	                Движение = Движения.Кошельки.Добавить();
	                Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	                Движение.Период = Дата;
	                Движение.Кошелек = Кошелек;
					Движение.Статья = Справочники.Статьи.Перевод;//ПРЕДОПРЕДЕЛЕННЫЙ!
	                Движение.Сумма = Сумма;
	                //2. Добавляем в кошелек-получатель
                    Движения.Кошельки.Записывать = Истина;
					Движение = Движения.Кошельки.Добавить();
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
					Движение.Период = Дата;
					Движение.Кошелек = Цель;
					Движение.Статья = Справочники.Статьи.Перевод;//ПРЕДОПРЕДЕЛЕННЫЙ!
					Движение.Сумма = Сумма;
					
		 //Если же это просто затрата - делаем проводку и по затратам, и по кошелькам!
         //(оставляем то, что было сформировано конструктором)
	     Иначе
		          //{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
                  // Данный фрагмент построен конструктором.
                  // При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
				  
				  // регистр Кошельки Расход
                  Движения.Кошельки.Записывать = Истина;
                  Движение = Движения.Кошельки.Добавить();
                  Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
                  Движение.Период = Дата;
                  Движение.Кошелек = Кошелек;
                  Движение.Сумма = Сумма;
                  Движение.Статья = Цель;
				  
				  // регистр Затраты 
	              Движения.Затраты.Записывать = Истина;
	              Движение = Движения.Затраты.Добавить();
	              Движение.Период = Дата;
	              Движение.Статья = Цель;
	              Движение.Сумма = Сумма;
	              Движение.Кошелек = Кошелек;

	              //}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
				  
		КонецЕсли;
			  
КонецПроцедуры
